

#define _CRT_SECURE_NO_DEPRECATE
# include<stdio.h>

int main()
{
	/*
	【例8.6】有一个整型数组 a，有10个元素，要求输出数组中的全部元素。
	*/

	printf("----------------------例8.6-------------------\n");
	/*-----------------例8.6 方法1--------------------*/
	int a[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int i;
	for (i = 0; i < 10; i++)
	{
		printf("%d ", *(a+i));
	}
	printf("\n");

	/*-----------------例8.6 方法2--------------------*/
		
	for (i = 0; i < 10; i++)
	{
		printf("%d ", a[i]);
	}
	printf("\n");

	/*
	【例8.7】通过指针变量输出整型数组 a的10个元素。(要求：输入输出全部用指针)
	*/
	printf("----------------------例8.7-------------------\n");
	int* p;
	int a1[10];
	for (p = a1; p < a1 + 10; p++)
	{
		scanf("%d", p);
	}

	p = a1;

	for (p = a1; p < a1 + 10; p++)
	{
		printf("%d ", *p);
	}


	/*
	【例8.7】通过指针变量输出整型数组 a的10个元素。(要求：输入输出全部用指针)
	*/
	printf("----------------------例8.7-------------------\n");
	int* p;
	int a1[10];
	for (p = a1; p < a1 + 10; p++)
	{
		scanf("%d", p);
	}

	p = a1;

	for (p = a1; p < a1 + 10; p++)
	{
		printf("%d ", *p);
	}

	/*
		【例8.8】将数组 a中n个整数按相反顺序存放，见图8.12 示意。
	*/

	printf("----------------------例8.8-------------------\n");
	int a2[10];
	int* p2;
	int a3 ;

	p2 = a2;
	for (p2 = a2; p2 < a2 + 10; p2++)
	{
		scanf("%d", p2);
	}

	p2 = a2;
	for (a3 = 0; a3 < 5; a3++)
	{
		int a = 0;
		a = *p2;
		*p2 =*( a2 + 9-a3);
		*(a2 + 9 - a3) = a;

		p2++;
	}

	p2 = a2;
	for (p2 = a2; p2 < a2 + 10; p2++)
	{
		printf("%d ", *p2);
	}

	return 0;
}
